app/controllers/home_controller.rb

  def transactions_summary status
    charges = []
    combine = []
    CreditCardCharge.all.each do |value|
      charges << value.records if value.records['paid'] == status
    end
    charges.each do |val|
      customer_name = Customer.where(id: val["customer_id"]).first.first_name
---
SELECT "credit_card_charges".* FROM "credit_card_charges"
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 ORDER BY "customers"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]